<img src="images/pandas-intro.png">

In [ ]:
# Module 01:
# - DS/ML/DL/AI Big Picture 
# - Data and Its types(Application)
# - 3Vs (Vel, Var, Vol)
# - DS Field Trend
# - DS/ML Project LifeCyle
#     - Problem Statement
#     - Data Collection
#     - Data Preparation 
#     - EDA 
#     - Feature Engineering 
#     - Model Training
#     - Model Evaluation and Tuning
#     - Model Development
#     - Model Deployment
#     - Model Monitor and its Main.
# - Data Analyst/ ML Engineer/ Data Scientist/ Data Engineer
# - Course Matrix

# Module 02(Introduction to Python Programming):
# - Hello World in Python
# - Variables
# - Numeric data types
# - Operators 
# - Mutable and Immutable data-type
# - String(define, access, slicing , conctenation, string-methods-> lower, upper, )
# - List()
# - Tuple
# - Set 
# - Dictionary
# - Selection Structure(if, else, if-else, elif, nested if-else)
# - Repetition Structure (while, for, nested)
# - Functions(user-define, built-in functions)
#     - lambda, map, reduce, filter, sorted
# - Exceptions(try, except, finally)
# - Modules(math, os, random, time, datetime, Calendar,  urllib) and Packages
# - File Handling(read, readline, readlines)
# - Regular Expression 


# Module 04: (Python -> Numpy(creation, universal/arithmetic/slicing/Broadcasting/stack/concatenation ) (File Handling using NumPy))

# _Python_Pandas_Introduction

<img align="center" width="700" height="700"  src="images/pandas-apps.png"  >

> **Pandas is an open source python library built on top of numpy and provides easy to use data structures and data analysis tools. Pandas has derived its name from panel data system and was developed by wes mckinney in 2008.**

> **Data scientists use pandas for performing various data science tasks starting from downloading, opening, reading and writing files of different file formats like csv, excel, json, html and so on. They load the data set into its data structure called data frame.**

> **A Pandas Dataframe is a 2-dimensional labeled data structure (like SQL table) with heterogeneously typed columns, having both a row and a column index.**

> **After the data is loaded in a data frame the data scientists perform a various data manipulation tasks like filtering and modifying data based on multiple conditions cutting, splitting, merging, sorting, scaling, pivoting and aggregating of data.**

> **Data cleaning is done to enhance the data accuracy and integrity by identifying and removing null values, duplicates and outliers.**

> **Data wrangling actually transforms the data structurally to appropriate format and makes it ready to be used by the machine learning engineers so that they can apply appropriate machine learning models or algorithm on that data set for training validating and testing purposes.**

# Learning Agenda of this Notebook:
- What is Pandas and how is it used in AI?
- Key features of Pandas
- Data Types in Pandas
- What does Pandas deal with?

- Creating Series in Pandas
    - From Python List
    - From NumPy Arrays
    - From Python Dictionary
    - From a scalar value
    - Creating empty series object
- Attributes of a Pandas Series
- Arithmetic Operations on Series

- Dataframes in Pandas
    - Anatomy of a Dataframe
    - Creating Dataframe
        - An empty dataframe
        - Two-Dimensional NumPy Array
        - Dictionary of Python Lists
        - Dictionary of Panda Series
    - Attributes of a Dataframe
    - Bonus
- Reading different file formats in Pandas
- Data Handling with Pandas
  - Practice Exercise I
  - Practice Exercise II
- All Statistical functions in Pandas
- Input/Output Operations
- Aggregation & Grouping
  - Practice Exercise
- Merging, Joining and Concatenation
  - Practice Exercise
- How To Perform Data Visualization with Pandas
- Exercise I
- Exercise II
- Pandas's Assignment

### Data Structures in Pandas:
<img src="https://www.databricks.com/wp-content/uploads/2019/03/pandas1.png">

>-  **A Pandas Dataframe is a 2-dimensional labeled data structure (like SQL table) with heterogeneously typed columns, having both a row and a column index.**
>-  **In short Pandas is a Software Libarary in Computer Programming and it is written for the Python Programming Language its work to do `data analysis and manipulation.`**

## So, what is Pandas and how is it used in AI?

Artificial Intelligence is about executing machine learning algorithms on products that we use every day. Any ML algorithm, for it to be effective, needs the following prerequisite steps to be done.
- `Data Collection` – Conducting opinion Surveys, scraping the internet, etc.
- `Data Handling` – Viewing data as a table, performing cleaning activities like checking for spellings, removal of blanks and wrong cases, removal of invalid values from data, etc.
- `Data Visualization` – plotting appealing graphs, so anyone who looks at the data can know what story the data tells us.
- `Pandas` – short for `Panel Data` (A panel is a 3D container of data) – is a library in python which contains in-built functions to clean, transform, manipulate, visualize and analyze data.

## Key Features of Pandas
<img src="images/Python-Pandas-Features.webp" height=600px width=600px>


- It has a fast and efficient DataFrame object with the default and customized indexing.
- Used for reshaping and pivoting of the data sets.
- Group by data for aggregations and transformations.
- It is used for data alignment and integration of the missing data.
- Provide the functionality of Time Series.
- Process a variety of data sets in different formats like matrix data, tabular heterogeneous, time series.
- Handle multiple operations of the data sets such as subsetting, slicing, filtering, groupBy, re-ordering, and re-shaping.
- It integrates with the other libraries such as SciPy, and scikit-learn.

## Data Types
A data type is used by a programming language to understand how to store and manipulate data.
- `int` : Integer number, eg: 10, 12
- `float` : Floating point number, eg: 100.2, 3.1415
- `bool` : True/False value
- `object` : Text, non-numeric, or a combination of text and non-numeric values, eg: Apple(It is `str` of Python)
- `DateTime` : Date and time values
- `category` : A finite list of values

## What does Pandas deal with?
There are two major categories of data that you can come across while doing data analysis.

- One dimensional data (Series)
- Two-dimensional data (DataFrame)

These data can be of any data type. Character, number or even an object.

> **Series in Pandas is one-dimensional data, and data frames are 2-dimensional data. A series can hold only a single data type, whereas a data frame is meant to contain more than one data type.**

![](images/dataframe.webp)

**In the example shown above, `Name` is a `series` and it is of the datatype – `Object` and it is treated as a character array. `Age` is another series and it is of the type – `Integer`. Third is the `Marks` is the third series and it is of the type `Integer` again.  The individual Series are one dimensional and hold only one data type. However, the `dataframe` as a whole contains more than 2 data-types and is `heterogeneous` in nature.**

# Creating Series & data frames in python

## Creating a simple Serie


<img align="right" width="500" height="600"  src="images/series-anatomy.png"  >

> **A Series is a one-dimensional array capable of holding a sequence of values of any data type (integers, floating point numbers, strings, Python objects etc) which by default have numeric data labels starting from zero. You can imagine a Pandas Series as a column in a spreadsheet or a Pandas Dataframe object.**
- To create a Series object you can use `pd.Series()` method

**```pd.Series(data, index, dtype, name)```**
- Where,
   - `data`: can be a Python list, Python dictionary, numPy array, or a scalar value.
   - `index`: If you donot pass the index argument, it will default to `np.arrange(n)`. Indices must be hashable (numbers or strings) and have the same length as `data`. Non-unique index values are allowed. Index is used for three purposes:
       - Identification.
       - Selection.
       - Alignment.
   - `dtype`: Optionally, you can assign any valid numpy datatype to the series object (np.sctypes). If not specified, this will be inferred from `data`.
   - `name`: Optionally, you can assign a name to a series, which becomes attribute of the series object. Moreover, it becomes the column name, if that series object is used to create a dataframe later.

In [2]:
import pandas as pd
import numpy as np

In [3]:
pd.__version__, pd.__path__

('1.5.3', ['/home/dell/.local/lib/python3.8/site-packages/pandas'])

### a. Creating a Series from Python List

In [ ]:
list1 = ['Ehtisham', 'Ali', 'Ayesha', '','Dua']  # note the empty string

# When index is not provided, it creates an index for the data starting from zero and with a step size of one.
s = pd.Series(data=list1)

In [ ]:
print(s)

print()
print()

print(type(s))

> Observe that output is shown in two columns - the `index` is on the left and the `data value` is on the right. If we do not explicitly specify an index for the data values while creating a series, then by default indices range from `0` through `N – 1`. Here N is the number of data elements.

**You can explicitly specify the index for a Series object, which can be either int or string type, and must be of the same size as the values in the series. Otherwise, it will raise a ValueError**

In [ ]:
list1 = ['Ehtisham', 'Ali', 'Ayesha', 'Dua']
indices = ['01', '02', '', '02']   # non-unique index values are allowed and you can have empty string as index

s = pd.Series(data=list1, index=indices)

In [ ]:
print(s)

In [ ]:
print(type(s))

In [ ]:
s['02']

> Also note that non-unique indices are allowed.

In [ ]:
list1 = ['Ehtisham', 'Ali', 'Ayesha', 'Dua']
indices = [2.1, 2.2, 2.3, 2.4,]   

s = pd.Series(data=list1, index=indices)

In [ ]:
print(s)
print()
print()

print(type(s))

**You can create a series with NaN values, using `np.nan`, which is IEEE 754 floating-point representation of Not a Number. NaN values can act as a placeholder for any missing numerical values in the array.**

In [ ]:
list1 = [1, 2.7, np.nan, 54]


s = pd.Series(data=list1)

In [ ]:
print(s)
print(type(s))

> Also note the `dtype` of the series object is inferred from the data as `float64`.

**You can use the `dtype` argument to specify a datatype to the series object.**

In [ ]:
list1 = [27, 33, 19]

s = pd.Series(data=list1, dtype=np.int8)

In [ ]:
print(s)
print(type(s))

**Optionally, you can assign a name to a series, which becomes attribute of the series object. Moreover, it becomes the column name, if that series object is used to create a dataframe later.**

In [ ]:
list1 = ['Ehtisham', 'Ali', 'Ayesha', 'Dua']

indices = ['01', '02', '03', '04']

s = pd.Series(data=list1, index=indices, name='myseries1')

In [ ]:
print(s)
print(type(s))

In [ ]:
s.name

### b. Creating a Series from NumPy Array

In [ ]:
s = pd.Series(data = np.arange(4))

In [ ]:
print(s)
print(type(s))

### c. Creating a Series from Python Dictionary

In [ ]:
my_dict = {
    'name':"Ehtisham", 
    'gender':"Male", 
    'Role':"Student", 
    'subject':"Cloud Computing"
}


s = pd.Series(data=my_dict)

In [ ]:
print(s)
print()
print(type(s))

In [ ]:
s['gender']

> **When you create a series from dictionary, it will automatically take the `keys` as index and the `values` as data**

### d. Creating a Series from Scalar value

In [ ]:
s = pd.Series(data=25)


print(s)
print(type(s))

### e. Creating an Empty Series

In [ ]:
# Need to pass atleast `dtype` else you get a warning
s = pd.Series(dtype=np.int8)

print(s)
print(type(s))

## Attributes of Pandas  Series

- We can access certain properties called attributes of a series by using that property with the series name using dot `.` notation
- Mostly attributes of pandas series are similar to pandas dataframe.

In [ ]:
my_dict = {
        0:"Ehtisham Sadiq", 
        1:np.nan, 
        2:"Ali Sadiq", 
        3:"Ayesha Sadiq", 
        4:"Dua Sadiq", 
        5:"Khubaib Sadiq", 
        6:"Adeen Sadiq"
    }

s = pd.Series(my_dict, name="myseries1")
s

In [ ]:
# `name` attribute of a series object return the name of the series object
s.name

In [ ]:
# `index` attribute of a series object return the list of indices and its datatype
s.index

In [ ]:
# `values` attribute of a series object return the list of values and its datatype
s.values

In [ ]:
# `dtype` attribute of a series object return the type of underlying data
s.dtype

In [ ]:
# `shape` attribute of a series object return a tuple of shape of underlying data
s.shape

In [ ]:
# `nbytes` attribute of a series object return the number of bytes of underlying data (object data type take 8 bytes)
s.nbytes

In [ ]:
# `size` attribute of a series object return number of elements in the underlying data
s.size

In [ ]:
# `ndim` attribute of a series object return number of dimensions of underlying data
s.ndim

In [ ]:
# `hasnans` attribute of a series object return true if there are NaN values in the data
s.hasnans

<img align="right" width="500" height="500"  src="images/series-anatomy.png"  >

## Understanding Index in a Series
- Every series object has an index associated with every item. 
- The Pandas series object supports both integer-based (default) and label/string-based indexing and provides a host of methods for performing operations involving the index.
<br><br>

- Index in series object is used for three purposes:
    - Identification
    - Selection/Filtering/Subsetting
    - Alignment <br><br>
    
- There are three ways to access elements of a series:
    - Using `s[]` operator and specifying the index (integer/label)
    - Using `s.loc[]` method and specifying the index (integer/label)
    - Using `s.iloc[]` method and specify the position (an integer value from 0 to length-1). It also support negative indexing, the last element can be accessed by an index of -1

In [ ]:
# simple example of indexing on list

list1 =  ["s1", "s2", "s3", "s4", "s5"]

In [ ]:
list1

In [ ]:
list1[2]

### Working with Position Indexing

In [ ]:
list1 = [1,3,5,7,9] 
s1 = pd.Series(data=list1)
s1

In [ ]:
s1[1:3]

### Working with Label Indexing

In [ ]:
# Here write your code 

list1 = [1,3,5,7,9]

indices = ["s1", "s2", "s3", "s4", "s5"]

s1 = pd.Series(list1, index=indices, name="myseries")

In [ ]:
s1

In [ ]:
s1.values

In [ ]:
s1.index

In [ ]:
s1["s3"]

In [ ]:
# Label/string based index

s1.loc[["s3", "s4"]]

In [ ]:
# Position based Index
s1.iloc[2:4]

## Arithmetic Operations on Series

**Example 1:** Adding two series object with same integer indices

In [ ]:
list1 = [1,3,5,7,9] 
list2 = [2,4,6,8,10]

s1 = pd.Series(data=list1)
s2 = pd.Series(data=list2)

In [ ]:
print(s1)
print(s1.index)

In [ ]:
print(s2)
print(s2.index)

In [ ]:
s3 = s1 + s2

print(s3)
print(s3.index)

**Example 2:** Adding two series object having different integer indices.

In [ ]:
# First Series
list1 = [6,9,7,5]
index1 = [0,1,2,3]
s1 = pd.Series(data=list1, index=index1);

# Second Series
list2 = [8,6,2,1]
index2 = [0,2,3,5]
s2 = pd.Series(data=list2, index=index2);

In [ ]:
print(s1)
print(s1.index)

In [ ]:
print(s2)
print(s2.index)

In [ ]:
s3 = s1 + s2
print(s3)
print(s3.index)

**Problem:** While performing mathematical operations on series having mismatched indices, all missing values are filled in with NaN by default.

**Solution:** To handle this problem, instead of using the operators (`+, -, *, /`), an explicit call to `s.add()`, `s.sub()`, `s.mul()` and `s.div()` is preferred. This allows us to replace the missing values in any of the series witth a specific value, so as to have a concrete output in place of NaN

In [ ]:
s1.add(s2, fill_value=0) # Compare it with above result

**My dear fellows, please make time to practice following topics related to Series:**

- Boolean/Fancy Indexing and Slicing
- Use of `reset_index()` method for completely resetting the index
- Use of other manipulation methods like 
    - `s.pop(index)` is passed an index and it returns the data item at the index and removes it from series
    - `s.drop(indexes)` is passed one or a list of indices and returns a series of the data items. Series remains unchanged unless the inplace = True argument is passed
    - `s1.append(s2, ignore_index=False, verify_integrity=False)` is used to concatenate two series and return the concatenated series, original series remain unchanged
    - `s1.update(s2)` is used to miduft the series `s1` inplace using the values from passed series

> **We will discuss these while studying Pandas Dataframe object In Shaa Allah**

### Pandas Series vs NumPy 1-D Arrays

>- In a series object we can define our own labeled index to access elements of an array. These can be numbers or strings. NumPy arrays are accessed  by their integer position using numbers only.
>- In a series object the elements can be indexed in descending order also. In NumPy arrays, the indexing starts with zero for the first element and the index is fixed.
>- While performing arithmetic operations on series having misaligned indices, NaN or missing values may be generated. In NumPy arrays, the concept of broadcasting exist and there is no concept of NaN values. While performing arithmetic on incompatible numPy arrays the operation fails.
>- Series require more memory. NumPy arrays occupies lesser memory.

## Practice Questions:
- Write a Pandas program to convert a Pandan module Series to Python list and it’s type.
- Write a Pandas program to add, subtract, multiple and divide two Pandas Series having same indices.
- Write a Pandas program to compare the elements of the two Pandas Series.(Hint : pd.eq / pd.equals)
- Write a Pandas program to change the data type of given a column or a Series.
- Write a Pandas program to convert a given Series to an array(Hint : series.values.tolist())
- Write a Pandas program to sort a given Series.
- Write a Pandas program to add some data to an existing Series.(Hint : series.append()) 
- Write a Pandas program to create the mean and standard deviation of the data of a given Series.
- Write a Pandas program to get the items of a given series not present in another given series.(series.isin())


<img align="right" width="500" height="500"  src="images/dataframe.webp">


## 1. Creating a Dataframe
<br><br>
>**A Pandas Dataframe is a two-dimensional labeled data structure (like SQL table) with heterogeneously typed columns, having both a row and a column index.**

<br><br><br><br>

**```pd.DataFrame(data=None, index=None, columns=None, dtype=None)```**
- Where,
   - `data`: It can be a 2-D NumPy Array, a Dictionary of Python Lists, or a Dictionary of Panda Series (You can also create a dataframe from a file in CSV, Excel, JSON, HTML format or may be from a database table as well).
   - `index`: These are the row indices. Will default to RangeIndex (0, 1, 2, ..., n), if index argument is not passed and no indexing information is part of input data.
   - `columns`: These are the column indices or labels. Will default to RangeIndex (0, 1, 2, ..., n), if index argument is not passed and no indexing information is part of input data.
   - `dtype`: Data type to force. Only a single dtype is allowed. If None, infer.

### Creating a Dataframe
- An empty dataframe
- Two-dimensional NumPy Arrays
- Dictionary of Python Lists
- Dictionary of Pandas Series
- **Attributes of Dataframe**

#### An empty dataframe

In [ ]:
import pandas as pd
import numpy as np
df = pd.DataFrame()
print(df)

#### Dataframe from 2D NumPy Arrays

In [ ]:
arr = np.random.randint(10,100, size=(6,5))
arr

In [ ]:
df = pd.DataFrame(arr)
print("Dataframe from 2D NumPy Array !")
df

In [ ]:
# create column labels 
col_labels = ['col1','col2','col3','col4', 'col5']
df = pd.DataFrame(arr, columns=col_labels, )
df

> **Note:** use `index` parameter to change row labels.

In [ ]:
# df.columns returns all the columns name/labels
df.columns

In [ ]:
# retuns all row labels
df.index

### Bonus

In [ ]:
df.columns = df.columns.str.upper()
df

#### Creating a dataframe from a Dictionary of Python Lists

In [ ]:
# A dictionary of Python lists
people = {
    'name': ['Ehtisham','Ali','Ayesha','Dua','Adeen'],
    'age' : [23, 20, 17, 7, 3],
    'marks' : [70,80,60,90,94]
}
people

In [ ]:
df = pd.DataFrame(people)
print("dataframe from dictionary of python lists")
df

In [ ]:
df.columns = df.columns.str.upper()
df

**error while creating a dataframe from dictionary of Python lists**

In [ ]:
# # A dictionary of Python lists
# people = {
#     'name': ['Ehtisham','Ali','Ayesha','Dua','Adeen', 'Khubaib'],
#     'age' : [23, 20, 17, 7, 3],
#     'marks' : [70,80,60,90,94]
# }
# df = pd.DataFrame(people)
# df

#### Creating a dataframe from pandas series

In [ ]:
name = ['Ehtisham', 'Ali', 'Ayesha', 'Dua']
marks = [91.5,93,80,65]
age = [21,18,16,6]

#Creating a Series by passing list variable to Series() function of pandas 
name_ser = pd.Series(name)
marks_ser = pd.Series(marks)
age_ser = pd.Series(age)

#Printing Series
print("Name Series : ", name_ser, sep="\n")
print("Marks Series : ", marks_ser, sep="\n")
print("Age Series : ", age_ser,sep="\n")

#### Creating Dataframe from multiple Series

In [ ]:
#Creating a Series by passing list variable to Series() function of pandas 
name_ser = pd.Series(name)
marks_ser = pd.Series(marks)
age_ser = pd.Series(age)

# Creating a Dictionary by passing series as values of dictionary
dic = {
    'Name':name_ser,
    'Marks':marks_ser,
    'Age':age_ser
    }

In [ ]:
# Create dataframe by passing dictionary to pd.DataFrame function of pandas
df = pd.DataFrame(dic)
print("Printing of DataFrame .... ")
df

#### Dataframe containing NaN values

In [ ]:
# A dictionary of Python lists
people = {
    'name': ['Ehtisham','Ali','Ayesha','Dua','Adeen', ""],
    'age' : [23, 20, 17, 7, 3, np.NaN],
    'marks' : [70,80,60,np.NaN,90,94 ]
}
people

In [ ]:
df = pd.DataFrame(people)
df

### Attributes of Pandas Dataframe
- Like Series, we can access properties/attributes of a dataframe by using dot `.` notation

In [36]:
people = {
    "name" : ["Ehtisham", "Ali", "Ayesha", "Dua", "Khubaib", "Adeen"],
    "age" : [21, 20, 18, 17, 12, 10],
    "address": ["Lahore", "Karachi", "Lahore", "Islamabad", "Kakul", "Karachi"],
    "cell" : ["321-123", "320-431", "321-478", "324-446", "321-967", "320-678"],
    "bg": ["B+", "A-", "B+", "O-",np.NaN, "B+"]
}
people

{'name': ['Ehtisham', 'Ali', 'Ayesha', 'Dua', 'Khubaib', 'Adeen'],
 'age': [21, 20, 18, 17, 12, 10],
 'address': ['Lahore', 'Karachi', 'Lahore', 'Islamabad', 'Kakul', 'Karachi'],
 'cell': ['321-123', '320-431', '321-478', '324-446', '321-967', '320-678'],
 'bg': ['B+', 'A-', 'B+', 'O-', nan, 'B+']}

In [37]:
df_people = pd.DataFrame(data=people)
df_people

       name  age    address     cell   bg
0  Ehtisham   21     Lahore  321-123   B+
1       Ali   20    Karachi  320-431   A-
2    Ayesha   18     Lahore  321-478   B+
3       Dua   17  Islamabad  324-446   O-
4   Khubaib   12      Kakul  321-967  NaN
5     Adeen   10    Karachi  320-678   B+

In [8]:
df_people = pd.DataFrame(data=people, index=['BS01', 'BS02', 'BS03', 'BS04', 'BS05', 'BS06'])
df_people

          name  age    address     cell  bg
BS01  Ehtisham   21     Lahore  321-123  B+
BS02       Ali   20    Karachi  320-431  A-
BS03    Ayesha   18     Lahore  321-478  B+
BS04       Dua   17  Islamabad  324-446  O-
BS05   Khubaib   12      Kakul  321-967  A-
BS06     Adeen   10    Karachi  320-678  B+

In [9]:
# df_people.

In [10]:
# `shape` attribute of a dataframe object return a two value tuple containing rows and columns
# Note the rows count does not include the column labels and column count does not include the row index
df_people.shape

(6, 5)

In [11]:
# `ndim` attribute of a dataframe object returns number of dimensions (which is always 2)
df_people.ndim

2

In [12]:
# `size` attribute of a dataframe object returns the number of elements in the underlying data
df_people.size

30

In [14]:
# `index` attribute of a dataframe object return the list of row indices and its datatype
df_people.index

Index(['BS01', 'BS02', 'BS03', 'BS04', 'BS05', 'BS06'], dtype='object')

In [15]:
# `columns` attribute of a dataframe object return the list of column labels and its datatype
df_people.columns

Index(['name', 'age', 'address', 'cell', 'bg'], dtype='object')

### Operations on Columns

In [17]:
df_people.columns = df_people.columns.str.capitalize()

In [18]:
df_people

          Name  Age    Address     Cell  Bg
BS01  Ehtisham   21     Lahore  321-123  B+
BS02       Ali   20    Karachi  320-431  A-
BS03    Ayesha   18     Lahore  321-478  B+
BS04       Dua   17  Islamabad  324-446  O-
BS05   Khubaib   12      Kakul  321-967  A-
BS06     Adeen   10    Karachi  320-678  B+

In [19]:
#This attribute is used to fetch both index and column names.
df_people.axes

[Index(['BS01', 'BS02', 'BS03', 'BS04', 'BS05', 'BS06'], dtype='object'),
 Index(['Name', 'Age', 'Address', 'Cell', 'Bg'], dtype='object')]

In [21]:
# `values` attribute of a dataframe object returns a NumPy 2-D having all the values in the DataFrame, 
# without the row indices and column labels
data = df_people.values
data

array([['Ehtisham', 21, 'Lahore', '321-123', 'B+'],
       ['Ali', 20, 'Karachi', '320-431', 'A-'],
       ['Ayesha', 18, 'Lahore', '321-478', 'B+'],
       ['Dua', 17, 'Islamabad', '324-446', 'O-'],
       ['Khubaib', 12, 'Kakul', '321-967', 'A-'],
       ['Adeen', 10, 'Karachi', '320-678', 'B+']], dtype=object)

#### Convert 2D NumPy Array into Dataframe

In [24]:
pd.DataFrame(data= data, columns=['Name','Age','City','Cell','Bg'])

       Name Age       City     Cell  Bg
0  Ehtisham  21     Lahore  321-123  B+
1       Ali  20    Karachi  320-431  A-
2    Ayesha  18     Lahore  321-478  B+
3       Dua  17  Islamabad  324-446  O-
4   Khubaib  12      Kakul  321-967  A-
5     Adeen  10    Karachi  320-678  B+

In [26]:
df_people.empty

False

In [29]:
# `dtypes` attribute of a dataframe object return the data type of each column in the dataframe
df_people.dtypes

Name       object
Age         int64
Address    object
Cell       object
Bg         object
dtype: object

### Bonus

In [32]:
df_people.select_dtypes(include='O')

          Name    Address     Cell  Bg
BS01  Ehtisham     Lahore  321-123  B+
BS02       Ali    Karachi  320-431  A-
BS03    Ayesha     Lahore  321-478  B+
BS04       Dua  Islamabad  324-446  O-
BS05   Khubaib      Kakul  321-967  A-
BS06     Adeen    Karachi  320-678  B+

In [33]:
df_people.select_dtypes(exclude='O')

      Age
BS01   21
BS02   20
BS03   18
BS04   17
BS05   12
BS06   10

In [53]:
# To check missing values
df_people.isnull()

    name    age  address   cell     bg
0  False  False    False  False  False
1  False  False    False  False  False
2  False  False    False  False  False
3  False  False    False  False  False
4  False  False    False  False   True
5  False  False    False  False  False

In [54]:
# To check missing values
df_people.isnull().sum()

name       0
age        0
address    0
cell       0
bg         1
dtype: int64

In [55]:
# To check number on non-NA values
df_people.count()

name       6
age        6
address    6
cell       6
bg         5
dtype: int64

In [50]:
# To check unique values in a column
df_people['address']

0       Lahore
1      Karachi
2       Lahore
3    Islamabad
4        Kakul
5      Karachi
Name: address, dtype: object

In [43]:
df_people['address'].unique()

array(['Lahore', 'Karachi', 'Islamabad', 'Kakul'], dtype=object)

In [44]:
df_people['address'].nunique()

4

In [45]:
df_people['bg'].unique()

array(['B+', 'A-', 'O-', nan], dtype=object)

In [46]:
df_people['bg'].nunique()

3

### Data-Type of a Series

In [49]:
s1 = pd.Series(["Ehtisham","Ali",23, 20, "03054661042"])
s1

0       Ehtisham
1            Ali
2             23
3             20
4    03054661042
dtype: object

In [51]:
s1.values

array(['Ehtisham', 'Ali', 23, 20, '03054661042'], dtype=object)

In [52]:
s1.index

RangeIndex(start=0, stop=5, step=1)

In [57]:
df_people

       name  age    address     cell   bg
0  Ehtisham   21     Lahore  321-123   B+
1       Ali   20    Karachi  320-431   A-
2    Ayesha   18     Lahore  321-478   B+
3       Dua   17  Islamabad  324-446   O-
4   Khubaib   12      Kakul  321-967  NaN
5     Adeen   10    Karachi  320-678   B+

## Bonus

In [62]:
df_people.iloc[0:2]

       name  age  address     cell  bg
0  Ehtisham   21   Lahore  321-123  B+
1       Ali   20  Karachi  320-431  A-


#### The `df.info()` Method

In [63]:
#This method prints information about a DataFrame including the row indices, column labels, 
# non-null values count in each column, datatype and memory usage
df_people.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   name     6 non-null      object
 1   age      6 non-null      int64
 2   address  6 non-null      object
 3   cell     6 non-null      object
 4   bg       5 non-null      object
dtypes: int64(1), object(4)
memory usage: 368.0+ bytes

#### The `df.describe()` Method

In [65]:
# This method prints the descriptive view of all the columns of dataset which are numeric
df_people.describe()

             age
count   6.000000
mean   16.333333
std     4.412105
min    10.000000
25%    13.250000
50%    17.500000
75%    19.500000
max    21.000000

In [67]:
# This method prints the descriptive view of all the columns of dataset which are numeric
# df_people.describe(include='all')

In [1]:
from IPython.core.display import HTML

style = """
    <style>
        body {
            background-color: #f2fff2;
        }
        h1 {
            text-align: center;
            font-weight: bold;
            font-size: 36px;
            color: #4295F4;
            text-decoration: underline;
            padding-top: 15px;
        }
        
        h2 {
            text-align: left;
            font-weight: bold;
            font-size: 30px;
            color: #4A000A;
            text-decoration: underline;
            padding-top: 10px;
        }
        
        h3 {
            text-align: left;
            font-weight: bold;
            font-size: 30px;
            color: #f0081e;
            text-decoration: underline;
            padding-top: 5px;
        }

        
        p {
            text-align: center;
            font-size: 12 px;
            color: #0B9923;
        }
    </style>
"""

html_content = """
<h1>Hello</h1>
<p>Hello World</p>
<h2> Hello</h2>
<h3> World </h3>
"""

HTML(style + html_content)